import Zoom from "react-reveal/Zoom";

export default function AboutSection(props) {
  return (
    <div className="sec-container" style={{ direction: "rtl" }}>
      <Zoom cascade>
        <h1 className="secondary-title">מי אנחנו</h1>
        {props.size.width > 800 ? (
          <p className="secondary-paragraph" style={{direction: 'rtl'}}>
            <Zoom>
              אנחנו מתמחים בתחום ה-Barber, כל שיטות הדירוג, הגזירות והטכניקות
              המתקדמות בארץ ובעולם.
              <br />
              באתר שלנו תוכלו לקבוע תור לתספורות, עיצובי זקן או כל דבר אחר
              שתרצו.
              <br />
              החלטנו שהגיע הזמן לחלוק את כל הידע שצברנו במשך השנים ולהקים אקדמיה
              ללימוד עיצוב שיער לגברים, <br />
              באקדמיה תלמדו את כל הטכניקות והשיטות הסודיות של IM.BARBER, תלמדו
              שיווק ובתום הלימודים
              <br />
              תקבלו ערכת ספר מתחיל ותעודת Barber מקצועי.
              <br />
              רוצים לשמוע עוד ? גללו למטה
            </Zoom>
          </p>
        ) : (
          <p className="secondary-paragraph">
            אנחנו מתמקצעים בתחום ה-Barber, כל שיטות הדירוג, הגזירות והטכניקות
            המתקדמות בארץ ובעולם. באתר שלנו תוכלו לקבוע תור לתספורות, עיצובי זקן
            או כל דבר אחר שתרצו. החלטנו שהגיע הזמן לחלוק את כל הידע שצברנו במשך
            השנים ולהקים אקדמיה ללימוד עיצוב שיער לגברים, באקדמיה תלמדו את כל
            הטכניקות והשיטות הסודיות של IM.BARBER, תלמדו שיווק ובתום הלימודים
            תקבלו ערכת ספר מתחיל ותעודת Barber מקצועי.
            <br />
            רוצים לשמוע עוד ? גללו למטה
          </p>
        )}
      </Zoom>
    </div>
  );
}
